// Заголовок
header = "Распределение адаптивных ООП";
/*
// Данные по округам
axis_x_data = {
  SZFO:  [6, 10, 3],
  CFO:   [28, 15, 16],
  SKFO:  [3, 1, 1],
  YUFO:  [12, 1, 2],
  PVFO:  [6, 3, 4],
  URFO:  [8, 2, 2],
  SIBFO: [15, 8, 4],
  DALFO: [12, 4, 6]
};

data_title = {
  SZFO:  "Северозападный федеральный округ",
  CFO:   "Центральный федеральный округ",
  SKFO:  "Северо-Кавказский федеральный округ",
  YUFO:  "Южный федеральный округ",
  PVFO:  "Приволжский федеральный округ",
  URFO:  "Уральский федеральный округ",
  SIBFO: "Сибирский федеральный округ",
  DALFO: "Дальневосточный федеральный округ"
};

axis_x_h = ['СЗФО', 'ЦФО', 'СКФО', 'ЮФО', 'ПрФО', 'УрФО', 'СибФО', 'ДФО'];
axis_y_h = [0, 10, 20, 30, 40, 50];
*/
axis_x_title = "Федеральные округа";
axis_y_title = "Количество программ";

// Данные для легенды
legend_data = {
  header: "Распределение ООП по нозологиям",
  colors: ['#F44336','#FFEB3B','#3F51B5'],
  title: ['Нарушение зрения', 'Нарушение слуха',  'Поражение опорно-двигательного аппарата']
}

