// Заголовок
header = "Распределение адаптивных ООП";

// Данные по УГСН
data_content = {
  U01: [0, 0, 0],
  U02: [0, 0, 0],
  U03: [0, 0, 0],
  U04: [0, 0, 0],
  U05: [0, 0, 0],
  U06: [0, 0, 0],
  U07: [0, 0, 0],
  U08: [0, 0, 0],
  U09: [5, 4, 2],
  U10: [0, 0, 0],
  U11: [0, 0, 0],
  U12: [0, 0, 0],
  U13: [0, 0, 0],
  U14: [0, 0, 0],
  U15: [0, 0, 0],
  U16: [0, 0, 0],
  U17: [0, 0, 0],
  U18: [4, 1, 0],
  U19: [0, 0, 0],
  U20: [0, 0, 0],
  U21: [0, 0, 0],
  U22: [0, 0, 0],
  U23: [0, 0, 0],
  U24: [0, 0, 0],
  U25: [0, 0, 0],
  U26: [0, 0, 0],
  U27: [0, 0, 0],
  U28: [0, 0, 0],
  U29: [0, 0, 0],
  U34: [0, 0, 0],
  U35: [0, 0, 0],
  U36: [0, 0, 0],
  U37: [9, 4, 3],
  U38: [4, 2, 0],
  U39: [8, 2, 4],
  U40: [1, 1, 1],
  U41: [0, 0, 0],
  U42: [0, 0, 0],
  U43: [0, 0, 0],
  U44: [12, 8, 4],
  U45: [4, 0, 0],
  U46: [1, 1, 0],
  U47: [0, 0, 0],
  U48: [0, 0, 0],
  U49: [0, 0, 0],
  U50: [0, 0, 0],
  U51: [0, 0, 0],
  U52: [0, 0, 0],
  U53: [0, 0, 0],
  U54: [0, 0, 0],
};

// Сортировка данных таблицы
data_sort = true;

// Максимальная ширина диаграммы данных, px
width_max = 100;

// Цвета диаграммы данных
data_colors = ['linear-gradient(to right, #F33, #F99)', 'linear-gradient(to right, #FF3, #FF9)', 'linear-gradient(to right, #33F, #99F)'];
// Текст подсказки
data_titles = ['Нарушение зрения:', 'Нарушение слуха:', 'Поражение ОДА:'];

// Перечень УГСН
data_title = {
  U01: "Математика и механика",
  U02: "Компьютерные и информационные науки",
  U03: "Физика и астрономия",
  U04: "Химия",
  U05: "Науки о земле",
  U06: "Биологические науки",
  U07: "Архитектура",
  U08: "Техника и технологии строительства",
  U09: "Информатика и вычислительная техника",
  U10: "Информационная безопасность",
  U11: "Электроника, радиотехника и системы связи",
  U12: "Фотоника, приборостроение, оптические и биотехнические системы и технологии",
  U13: "Электро- и теплоэнергетика",
  U14: "Ядерная энергетика и технологии",
  U15: "Машиностроение",
  U16: "Физико-технические науки и технологии",
  U17: "Оружие и системы вооружения",
  U18: "Химические технологии",
  U19: "Промышленная экология и биотехнологии",
  U20: "Техносферная безопасность и природообустройство",
  U21: "Прикладная геология, горное дело, нефтегазовое дело и геодезия",
  U22: "Технологии материалов",
  U23: "Техника и технологии наземного транспорта",
  U24: "Авиационная и ракетно-космическая техника",
  U25: "Аэронавигация и эксплуатация авиационной и ракетно-космической техники",
  U26: "Техника и технологии кораблестроения и водного транспорта",
  U27: "Управление в технических системах",
  U28: "Нанотехнологии и материалы",
  U29: "Технологии легкой промышленности",
  U34: "Сестринское дело",
  U35: "Сельское, лесное и рыбное хозяйство",
  U36: "Ветеринария и зоотехния",
  U37: "Психологические науки",
  U38: "Экономика и управление",
  U39: "Социология и социальная работа",
  U40: "Юриспруденция",
  U41: "Политические науки и регионоведение",
  U42: "Средства массовой информации и информационно-библиотечное дело",
  U43: "Сервис и туризм",
  U44: "Образование и педагогические науки",
  U45: "Языкознание и литературоведение",
  U46: "История и археология",
  U47: "Философия, этика и религиоведение",
  U48: "Теология",
  U49: "Физическая культура и спорт",
  U50: "Искусствознание",
  U51: "Культуроведение и социокультурные проекты",
  U52: "Сценические искусства и литературное творчество",
  U53: "Музыкальное искусство",
  U54: "Изобразительное и прикладные виды искусств"
};

// Данные для легенды
legend_data = {
  header: "Распределение ООП по нозологиям",
  colors: ['#F44336','#FFEB3B','#3F51B5'],
  title: ['Нарушение зрения', 'Нарушение слуха',  'Поражение опорно-двигательного аппарата']
}
